# Реализовать паттерн проектирования "Шаблонный метод"
# Тематику выбирайте какую хотите (кафе, заводы, машины и прочее).
# В реализации пожеланий нет(функции, классы ...), главное чтобы решалась проблема описанная в паттерне который Вам попался.


import os.path

print(os.path.realpath(__file__))

print("TEST2")